In [2]:
#standard start
import pandas as pd
dataset_raw = pd.read_csv('C:/Users/admin1/Documents/GitHub/ds22_project/data/top_50_directors.csv')
dataset_raw.head(2)

,Position,Const,Created,Modified,Description,Name,Known For,Birth Date
0,1,nm0634240,2014-11-08,2014-11-08,NaN,Christopher Nolan,Tenet,1970-07-30
1,2,nm0386246,2014-11-08,2014-11-08,NaN,Rajkumar Hirani,PK,1962-11-20

In [ ]:
dataset_raw.info()